
/*
    * Homework 8.1-  Class and Method amd Object
    * 1. Создайте 3 класса в которых есть аттрибуты и методы
    * В классе Work создайте функцию main() и создайте в ней
    * по 2 объекта каждого класса - покажите как они работают
*/


public class Hw8CoffeeMaker {

    public String brand;

    public String model;

    public int year;


    public void allabout() {

        System.out.println("My coffee machine is: " + brand + ", " + "Model: " + model + " , " + "Made in :" + year);

    }




}
